Day-3/Blog - rails/simple_blog/app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "sdsdf"], ["body", "dsfsdf"], ["created_at", "2021-03-31 14:23:41.803145"], ["updated_at", "2021-03-31 14:23:41.803145"]]
---
    def create
        # render plain: params[:post].inspect
        @post = Post.new(post_params)

        @post.save